## 🌍 Terraform Plan (GKE - dev)
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.hub_cluster[0].keycloak_realm.argocd[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "keycloak_realm" "argocd" {
      - access_code_lifespan                     = "1m0s" -> null
      - access_code_lifespan_login               = "30m0s" -> null
      - access_code_lifespan_user_action         = "5m0s" -> null
      - access_token_lifespan                    = "5m0s" -> null
      - access_token_lifespan_for_implicit_flow  = "15m0s" -> null
      - action_token_generated_by_admin_lifespan = "12h0m0s" -> null
      - action_token_generated_by_user_lifespan  = "5m0s" -> null
      - attributes                               = {} -> null
      - browser_flow                             = "browser" -> null
      - client_authentication_flow               = "clients" -> null
      - client_session_idle_timeout              = "0s" -> null
      - client_session_max_lifespan              = "0s" -> null
      - default_default_client_scopes            = [] -> null
      - default_optional_client_scopes           = [] -> null
      - direct_grant_flow                        = "direct grant" -> null
      - docker_authentication_flow               = "docker auth" -> null
      - duplicate_emails_allowed                 = false -> null
      - edit_username_allowed                    = false -> null
      - enabled                                  = true -> null
      - id                                       = "argocd" -> null
      - internal_id                              = "argocd" -> null
      - login_with_email_allowed                 = false -> null
      - oauth2_device_code_lifespan              = "10m0s" -> null
      - oauth2_device_polling_interval           = 5 -> null
      - offline_session_idle_timeout             = "720h0m0s" -> null
      - offline_session_max_lifespan             = "1440h0m0s" -> null
      - offline_session_max_lifespan_enabled     = false -> null
      - realm                                    = "argocd" -> null
      - refresh_token_max_reuse                  = 0 -> null
      - registration_allowed                     = false -> null
      - registration_email_as_username           = false -> null
      - registration_flow                        = "registration" -> null
      - remember_me                              = false -> null
      - reset_credentials_flow                   = "reset credentials" -> null
      - reset_password_allowed                   = false -> null
      - revoke_refresh_token                     = false -> null
      - ssl_required                             = "external" -> null
      - sso_session_idle_timeout                 = "30m0s" -> null
      - sso_session_idle_timeout_remember_me     = "0s" -> null
      - sso_session_max_lifespan                 = "10h0m0s" -> null
      - sso_session_max_lifespan_remember_me     = "0s" -> null
      - user_managed_access                      = false -> null
      - verify_email                             = false -> null

      - otp_policy {
          - algorithm         = "HmacSHA1" -> null
          - digits            = 6 -> null
          - initial_counter   = 0 -> null
          - look_ahead_window = 1 -> null
          - period            = 30 -> null
          - type              = "totp" -> null
        }

      - web_authn_passwordless_policy {
          - acceptable_aaguids                = [] -> null
          - attestation_conveyance_preference = "not specified" -> null
          - authenticator_attachment          = "not specified" -> null
          - avoid_same_authenticator_register = false -> null
          - create_timeout                    = 0 -> null
          - relying_party_entity_name         = "keycloak" -> null
          - require_resident_key              = "Yes" -> null
          - signature_algorithms              = [
              - "ES256",
              - "RS256",
            ] -> null
          - user_verification_requirement     = "required" -> null
        }

      - web_authn_policy {
          - acceptable_aaguids                = [] -> null
          - attestation_conveyance_preference = "not specified" -> null
          - authenticator_attachment          = "not specified" -> null
          - avoid_same_authenticator_register = false -> null
          - create_timeout                    = 0 -> null
          - relying_party_entity_name         = "keycloak" -> null
          - require_resident_key              = "not specified" -> null
          - signature_algorithms              = [
              - "ES256",
              - "RS256",
            ] -> null
          - user_verification_requirement     = "not specified" -> null
        }
    }

  # module.hub_cluster[0].kubernetes_ingress_v1.argocd_ui[0] will be created
  + resource "kubernetes_ingress_v1" "argocd_ui" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "cert-manager.io/issuer"                         = "letsencrypt-prod"
              + "nginx.ingress.kubernetes.io/backend-protocol"   = "HTTP"
              + "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
            }
          + generation       = (known after apply)
          + name             = "argocd-server"
          + namespace        = "argocd-agent"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "nginx"

          + rule {
              + host = "argocd.observe.camer.digital"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "argocd-server"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "argocd.observe.camer.digital",
                ]
              + secret_name = "argocd-server-tls"
            }
        }
    }

  # module.hub_cluster[0].null_resource.hub_argocd_apps_any_namespace is tainted, so must be replaced
-/+ resource "null_resource" "hub_argocd_apps_any_namespace" {
      ~ id = "4717554159552645991" -> (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_argocd_resource_health_config will be created
  + resource "null_resource" "hub_argocd_resource_health_config" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_argocd_server_insecure[0] will be created
  + resource "null_resource" "hub_argocd_server_insecure" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_pki_initialization will be created
  + resource "null_resource" "hub_pki_initialization" {
      + id       = (known after apply)
      + triggers = {
          + "context"   = "gke_observe-472521_europe-west3_observe-prod-cluster"
          + "namespace" = "argocd-agent"
        }
    }

  # module.hub_cluster[0].null_resource.hub_pki_jwt_signing_key will be created
  + resource "null_resource" "hub_pki_jwt_signing_key" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_pki_principal_server_cert_initial will be created
  + resource "null_resource" "hub_pki_principal_server_cert_initial" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_pki_principal_server_cert_updated is tainted, so must be replaced
-/+ resource "null_resource" "hub_pki_principal_server_cert_updated" {
      ~ id = "2038729293161802269" -> (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_pki_resource_proxy_cert will be created
  + resource "null_resource" "hub_pki_resource_proxy_cert" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_principal_allowed_namespaces_config will be created
  + resource "null_resource" "hub_principal_allowed_namespaces_config" {
      + id       = (known after apply)
      + triggers = {
          + "namespaces" = "default"
        }
    }

  # module.hub_cluster[0].null_resource.hub_principal_env_vars_config will be created
  + resource "null_resource" "hub_principal_env_vars_config" {
      + id       = (known after apply)
      + triggers = {
          + "config_version" = "v1"
        }
    }

  # module.hub_cluster[0].null_resource.hub_principal_installation will be created
  + resource "null_resource" "hub_principal_installation" {
      + id       = (known after apply)
      + triggers = {
          + "context"      = "gke_observe-472521_europe-west3_observe-prod-cluster"
          + "manifest_url" = "https://github.com/argoproj-labs/argocd-agent/install/kubernetes/principal?ref=v0.5.3"
          + "namespace"    = "argocd-agent"
          + "version"      = "v0.5.3"
        }
    }

  # module.hub_cluster[0].null_resource.hub_principal_resource_proxy_config will be created
  + resource "null_resource" "hub_principal_resource_proxy_config" {
      + id       = (known after apply)
      + triggers = {
          + "config_version" = "v1"
        }
    }

  # module.hub_cluster[0].null_resource.hub_principal_restart will be created
  + resource "null_resource" "hub_principal_restart" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_redis_network_policy_patch will be created
  + resource "null_resource" "hub_redis_network_policy_patch" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.resource_proxy_credentials_secret[0] will be created
  + resource "null_resource" "resource_proxy_credentials_secret" {
      + id       = (known after apply)
      + triggers = {
          + "credentials_count" = "0"
        }
    }

  # module.hub_cluster[0].null_resource.resource_proxy_verification[0] will be created
  + resource "null_resource" "resource_proxy_verification" {
      + id = (known after apply)
    }

  # module.spoke_cluster[0].null_resource.appproject_default_config[0] will be created
  + resource "null_resource" "appproject_default_config" {
      + id       = (known after apply)
      + triggers = {
          + "dest_namespaces"   = jsonencode(
                [
                  + "*",
                ]
            )
          + "hub_context"       = "gke_observe-472521_europe-west3_observe-prod-cluster"
          + "hub_namespace"     = "argocd-agent"
          + "source_namespaces" = jsonencode(
                [
                  + "*",
                ]
            )
        }
    }

  # module.spoke_cluster[0].null_resource.appproject_verify[0] will be created
  + resource "null_resource" "appproject_verify" {
      + id = (known after apply)
    }

Plan: 19 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  - keycloak_client_id  = "argocd" -> null
  - keycloak_config     = {
      - auth_method = "Client Auth"
      - client_id   = "argocd"
      - groups      = "ArgoCDAdmins (admin), ArgoCDDevelopers (edit), ArgoCDViewers (readonly)"
      - realm       = "argocd"
      - url         = "https://keycloak-dev.observe.camer.digital/realms/argocd"
    } -> null

```